tutorials/CFD/11UnsteadyBBOpen/0/Tlift2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tlift2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
22000
(
0.000158986
0.000476774
0.000794008
0.00111032
0.00142535
0.00173872
0.00205009
0.00235909
...
)
;

boundaryField
{
    Adiabatic_walls
    {
        type            zeroGradient;
    }
    Left
    {
        type            fixedValue;
        value           uniform 0;
    }
    Right
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    Outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
